Tekla Open API Reference for Tekla Structures 2025
View.ViewAttributes.TagsAttributes Property
 The attributes for view mark tags.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public View.ViewMarkTagsAttributes TagsAttributes { get; set; }
Public Property TagsAttributes As View.ViewMarkTagsAttributes
	Get
	Set
Property Value
Type: View.ViewMarkTagsAttributes
See Also
Reference
View.ViewAttributes Class
Tekla.Structures.Drawing Namespace